/**
 * @file debug_task1.h
 * @author lxlx (1729649497@qq.com)
 * @brief APP调试层，专门用来测试程序
 * @version 0.1
 * @date 2026-09-06
 * 
 * @copyright Copyright (c) 2026
 * 
 */

#pragma once

#ifdef __cplusplus
extern "C"{
#endif

/*----------------------------------include-----------------------------------*/

#include "FreeRTOS.h"
#include "cmsis_os2.h"
#include "task.h"
#include "pid_controller.h"

/*-----------------------------------macro------------------------------------*/

/*----------------------------------typedef-----------------------------------*/


/*----------------------------------variable----------------------------------*/

/*-------------------------------------os-------------------------------------*/

/*----------------------------------function----------------------------------*/

void debug1Task(void *argument);

/*------------------------------------test------------------------------------*/


#ifdef __cplusplus
}
#endif


